app/views/songs/_form.html.erb

    <% if @song.artist.nil? %>
      <% f.select :artist_id, options_from_collection_for_select(Artist.all, :id, :name) %><br>
---
SELECT "artists".* FROM "artists"