app/controllers/songs_controller.rb

  def new
    #@song = Song.new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"

  def edit
    #@song = Song.find(params[:id])
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]